In [1]:
import pymysql
import pandas as pd

conn = pymysql.connect(host='localhost', port=3306, user='root', passwd='', db='projet_python_airport')

cur = conn.cursor()

In [ ]:
1.	Identifier les clés primaires (PK), clés étrangères (FK) et les relations entre les différentes tables ?

In [ ]:
2.	Combien y-a-t-il d’aéroports, de compagnies, de destinations, d’avions, de fuseaux horaires 
et de zones aux Etats-Unis où on ne passe pas à l’heure d’été (indice : colonne dst) ?

In [3]:
pd.read_sql('SELECT count(*) as nbAeroports FROM airports', conn)
pd.read_sql('SELECT count(*) as nbCompagnies FROM airlines', conn)
pd.read_sql('SELECT count(*) as nbDestinations FROM flights', conn)
pd.read_sql('SELECT count(*) as nbAvions FROM planes', conn)
pd.read_sql('SELECT COUNT(DISTINCT tz) as nbFuseauxHoraires from airports', conn)
pd.read_sql('SELECT COUNT(*) as nbZone from airports WHERE dst = "N" AND tzone LIKE "%America/%"', conn)

   nbZone
0      14

In [ ]:
3.	Quel est l’aéroport de départ le plus emprunté ?
Quelles sont les 10 destinations les plus (moins) prisées ?
Quelle sont les 10 avions qui ont le plus (moins) décollé ?

In [9]:
pd.read_sql('SELECT origin, a.name, MAX(mycount) FROM ( SELECT origin, COUNT(origin) mycount FROM flights GROUP BY origin ) AS T INNER JOIN airports a ON a.faa = origin', conn)
pd.read_sql('SELECT dest, name, nombre FROM ( SELECT COUNT(*) AS NOMBRE, dest FROM flights GROUP BY dest ) AS T INNER JOIN airports ON dest = faa GROUP BY nombre DESC LIMIT 10', conn)
pd.read_sql('SELECT dest, NAME, nombre FROM ( SELECT COUNT(*) AS NOMBRE, dest FROM flights GROUP BY dest ) AS T INNER JOIN airports ON dest = faa GROUP BY nombre ASC LIMIT 10', conn)
pd.read_sql('SELECT planes.tailnum, COUNT(planes.tailnum) FROM planes INNER JOIN flights ON planes.tailnum = flights.tailnum GROUP BY planes.tailnum ORDER BY COUNT(planes.tailnum) DESC LIMIT 10', conn)
pd.read_sql('SELECT planes.tailnum, COUNT(planes.tailnum) FROM planes INNER JOIN flights ON planes.tailnum = flights.tailnum GROUP BY planes.tailnum ORDER BY COUNT(planes.tailnum) ASC LIMIT 10', conn)

  tailnum  COUNT(planes.tailnum)
0  N766SK                      1
1  N940UW                      1
2  N836AW                      1
3  N907DA                      1
4  N790SK                      1
5  N670US                      1
6  N881AS                      1
7  N587NW                      1
8  N653UA                      1
9  N845MH                      1

In [ ]:
4.	Trouver combien chaque compagnie a desservi de destination ; 
combien chaque compagnie a desservie de destination par aéroport d’origine. 
Réaliser les graphiques adéquats qui synthétisent ces informations ?

In [19]:
pd.read_sql('SELECT a.name, COUNT(f.carrier) as nbDestination FROM flights f INNER JOIN airlines a ON f.carrier = a.carrier GROUP BY f.carrier HAVING COUNT(f.carrier)', conn)

                           name  nbDestination
0             Endeavor Air Inc.          18460
1        American Airlines Inc.          32729
2          Alaska Airlines Inc.            714
3               JetBlue Airways          54635
4          Delta Air Lines Inc.          48110
5      ExpressJet Airlines Inc.          54173
6        Frontier Airlines Inc.            685
7   AirTran Airways Corporation           3260
8        Hawaiian Airlines Inc.            342
9                     Envoy Air          26397
10        SkyWest Airlines Inc.             32
11        United Air Lines Inc.          58665
12              US Airways Inc.          20536
13               Virgin America           5162
14       Southwest Airlines Co.          12275
15           Mesa Airlines Inc.            601

In [ ]:
5.	Trouver tous les vols ayant atterri à Houston (IAH ou HOU) (indice : 9313 vols). 
Combien de vols partent de NYC airports vers Seattle (indice : 3923 vols), 
combien de compagnies desservent cette destination (indice : 5 compagnies) 
et combien d’avions “uniques” (indice : 935 avions) ?

In [24]:
pd.read_sql('SELECT flight FROM flights WHERE dest="IAH" OR dest="HOU"', conn)
pd.read_sql('SELECT DISTINCT flight FROM flights WHERE origin="JFK" OR origin="EWR" OR origin="LGA" OR origin="JRB" AND dest="SEA"', conn)
pd.read_sql('SELECT DISTINCT carrier, dest FROM flights WHERE dest="SEA"', conn)
pd.read_sql('SELECT DISTINCT tailnum FROM flights WHERE dest="SEA"', conn)

    tailnum
0    N594AS
1    N3760C
2    N45440
3    N37464
4    N503JB
..      ...
931  N833UA
932  N557AS
933  N483UA
934  N814UA
935  N561JB

[936 rows x 1 columns]

In [ ]:
6.	Trouver le nombre de vols unique par destination voir l’aperçu. 
Trier les vols suivant la destination, l’aéroport d’origine, la compagnie dans un ordre alphabétique croissant 
(en réalisant les jointures nécessaires pour obtenir les noms des explicites des aéroports) ? 
indice : voir l’aperçu

In [ ]:
7.	Quelles sont les compagnies qui n'opèrent pas sur tous les aéroports d’origine ? 
Quelles sont les compagnies qui desservent l’ensemble de destinations ?
Faire un tableau où l’on récupère l’ensemble des origines et des destinations pour l’ensemble des compagnies. indice :

In [ ]:
8.	Quelles sont les destinations qui sont exclusives à certaines compagnies
(indice : 28 destinations en toutalors que sur R on trouve 29 pourquoi) ?

In [ ]:
9.	Filtrer le vol pour trouver ceux exploités par United, American ou Delta (indice : 139 504 vols en tout) ?